---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcs
source: html/89ebaf9b-a5fa-a1a8-6036-69596f58f663.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcs Property

Sorry, we can't use arcs here.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotHaveArcs { get; }
```